---
kind: enumMember
id: F:Autodesk.Revit.DB.FamilySizeTableErrorType.InvalidHeaderSeparator
enum: Autodesk.Revit.DB.FamilySizeTableErrorType
source: html/daca2b01-2286-87d3-ada3-621c792b2cf4.htm
---
# Autodesk.Revit.DB.FamilySizeTableErrorType.InvalidHeaderSeparator

The CSV file header separator is not invalid. Valid header separators are comma(,), semicolon(;), colon(:), and pipe (|).